index.org
#+AUTHOR: TANG ZhiXiong

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/github-gist.min.css">

#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery-1.11.0.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery-ui-1.10.2.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery.localscroll-min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery.scrollTo-1.4.3.1-min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery.zclip.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/bigblow.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/hideshow.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/highlight.min.js"></script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://tangzhixiong.com/readings/css/main.css"/>
#+HTML_HEAD: <script type="text/javascript" src="http://tangzhixiong.com/readings/javascript/main.js"></script>

#+HTML_HEAD: <script>$(function(){ /*todo*/ });</script>

* stackoverflow-Java-top-qa
** 一些基本的约定
-  文档的文件名，和 =stackoverflowhich-notnull-java-annotation-should-i-usew= 上 的 url 保持一致。
   例如， =http://stackoverflow.com/questions/8710619/java-operator= 的文件名， 就是 =java-operator.md=
-  在每篇翻译文档内容的最后，要附上 stackoverflow 的原文链接
** 每个人可以做（但不限于）

-  找未翻译的问题进行翻译
-  优化已翻译的问题
-  输出问答精简汇总版（把所有的问答集中到一个 md
   文件，然后尽量精简，让别人可 以在一天内把这 100 个问题的精髓都看完）
-  输出 gitbook 版本（现在直接在 github 上查看，体验不好）

** 文档优化反馈
请大家多多反馈，优化已翻译好的文章：可以到 [[https://github.com/giantray/stackoverflow-java-top-qa/issues/66][吐槽区]] 吐槽， 也可以在已翻
译文章基础上进行优化，提新的 PR。文章质量的提升，需要大家一起努力！
** 目录
