index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2017-10-03 Tue 14:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="TANG ZhiXiong" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/github-gist.min.css">
<link rel="stylesheet" type="text/css" href="http://tangzhixiong.com/readings/css/main.css"/>
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. stackoverflow-Java-top-qa</a>
<ul>
<li><a href="#sec-1-1">1.1. 一些基本的约定</a></li>
<li><a href="#sec-1-2">1.2. 每个人可以做（但不限于）</a></li>
<li><a href="#sec-1-3">1.3. 文档优化反馈</a></li>
<li><a href="#sec-1-4">1.4. 目录</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. <code>[32/38]</code> 基础语法</a></li>
<li><a href="#sec-1-4-2">1.4.2. <code>[8/21]</code> 编程技巧</a></li>
<li><a href="#sec-1-4-3">1.4.3. 网络</a></li>
<li><a href="#sec-1-4-4">1.4.4. 性能</a></li>
<li><a href="#sec-1-4-5">1.4.5. 测试</a></li>
<li><a href="#sec-1-4-6">1.4.6. Android</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> stackoverflow-Java-top-qa</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 一些基本的约定</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>文档的文件名，和 <code>stackoverflowhich-notnull-java-annotation-should-i-usew</code> 上 的 url 保持一致。
例如， <code>http://stackoverflow.com/questions/8710619/java-operator</code> 的文件名， 就是 <code>java-operator.md</code>
</li>
<li>在每篇翻译文档内容的最后，要附上 stackoverflow 的原文链接
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 每个人可以做（但不限于）</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>找未翻译的问题进行翻译
</li>
<li>优化已翻译的问题
</li>
<li>输出问答精简汇总版（把所有的问答集中到一个 md
文件，然后尽量精简，让别人可 以在一天内把这 100 个问题的精髓都看完）
</li>
<li>输出 gitbook 版本（现在直接在 github 上查看，体验不好）
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 文档优化反馈</h3>
<div class="outline-text-3" id="text-1-3">
<p>
请大家多多反馈，优化已翻译好的文章：可以到 <a href="https://github.com/giantray/stackoverflow-java-top-qa/issues/66">吐槽区</a> 吐槽， 也可以在已翻
译文章基础上进行优化，提新的 PR。文章质量的提升，需要大家一起努力！
</p>
</div>
</div>
