index.html
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 目录</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> <code>[32/38]</code> 基础语法</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li><code>[X]</code> <a href="contents/java-operator.md">Java += 操作符实质</a>
</li>
<li><code>[X]</code> <a href="contents/read-convert-an-inputstream-to-a-string.md">将 Inputstream 转换为 String</a>
  Apache commons IOUtils

<div class="org-src-container">

<pre class="src src-java">// method 1
StringWriter writer = new StringWriter();
IOUtils.copy(inputStream, writer, encoding);
String theString = writer.toString();

// method 2
String theString = IOUtils.toString(inputStream, encoding);

// method 3
static String convertStreamToString(java.io.InputStream is) {
    java.util.Scanner s = new java.util.Scanner(is).useDelimiter("\\A");
    return s.hasNext() ? s.next() : "";
}
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/create-arraylist-from-array.md">将数组转换为 List</a>
<div class="org-src-container">

<pre class="src src-java">// method 1
new ArrayList&lt;Element&gt;(Arrays.asList(array));

// 定长, 不能 add, remove (搞得跟 array 就一样了)
// method 2
Arrays.asList(array);
// method 3
Arrays.asList(new Element(1),new Element(2),new Element(3));
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/iterate-through-a-hashmap.md">如何遍历 map 对象</a>
<div class="org-src-container">

<pre class="src src-java">// method 1: entrySet
Map&lt;Integer, Integer&gt; map = new HashMap&lt;Integer, Integer&gt;();
for(Map.Entry&lt;Integer, Integer&gt; entry : map.entrySet()){
    System.out.println("key = " + entry.getKey() + ", value = " + entry.getValue())
}

// method 2: keySet(), values()

// method 3: iterator
Map&lt;Integer, Integer&gt; map = new HashMap&lt;Integer, Integer&gt;();
Iterator&lt;Map.Entry&lt;Integer, Integer&gt;&gt; entries = map.entrySet().iterator();
while (entries.hasNext()) {
    Map.Entry&lt;Integer, Integer&gt; entry = entries.next();
    System.out.println("Key = " + entry.getKey() + ", Value = " + entry.getValue());
}

// method 4: 迭代 keys 并搜索 values（低效的）
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> <a href="contents/in-java-whats-the-difference-between-public-default-protected-and-private.md">public，protected，private，不加修饰符。有什么区别呢？</a>
</li>
<li><code>[X]</code> <a href="contents/how-can-i-test-if-an-array-contains-a-certain-value.md">如何测试一个数组是否包含指定的值？</a>
<div class="org-src-container">

<pre class="src src-java">// method 1
Arrays.asList(...).contains(...)

// method 2
String[] fieldsToInclude = { "id", "name", "location" };
if ( ArrayUtils.contains( fieldsToInclude, "id" ) ) {
    // Do some stuff.
}

// method 3, for ordered list
Arrays.binarySearch(arr, targetValue);
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/what-issues-should-be-considered-when-overriding-equals-and-hashcode-in-java.md">重写（Override）equlas 和 hashCode 方法时应考虑的问题</a>
<ul class="org-ul">
<li>equals() 定义了对象的相等关系（自反性、对称性、传递性）
</li>
<li>hashCode 只是尽量要求不重合
</li>
<li>equals 的对象, hashCode 也要一样, hashCode 一样, 不一定 equal
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/breaking-out-of-nested-loops-in-java.md">从一个多层嵌套循环中直接跳出</a>
  break+label, 我觉得这个和 goto 就很类似了. 应当避免这样写.
</li>
<li><code>[X]</code> <a href="contents/converting-string-to-int-in-java.md">如何将 String 转换为 Int</a>
<ul class="org-ul">
<li>Integer.valueOf(str); ==&gt; Integer
</li>
<li>Integer.parseInt(str); ==&gt; int (possible NumberFormatException)
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/how-to-split-a-string-in-java.md">如何分割（split）string 字符串</a>
<ul class="org-ul">
<li><code>String[] parts = string.split("-");</code>
</li>
<li>需要注意的是，该方法的参数是个正则表达式, 要注意对某些字符做转码。
例如，.在正则表达式中表示任意字符，因此，如果你要通过.号做分割，需要这样写，split("\\.")或者split(Pattern.quote("."))
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/how-do-i-compare-strings-in-java.md">在 java 中如何对比（compare）string</a>
</li>
<li><code>[X]</code> <a href="contents/how-to-sort-a-mapkey-value-on-the-values-in-java.md">=Map&lt;Key,Value&gt;=基于 Value 值排序</a>
<ul class="org-ul">
<li>1: 使用 TreeMap，可以参考下面的代码

<p>
The TreeMap class implements the Map interface by using a tree. A
TreeMap provides an efficient means of storing key/value pairs in
sorted order, and allows rapid retrieval.
</p>
</li>
<li>2: 先通过 linkedlist 排好序，再放到 LinkedHashMap 中
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/differences-between-hashmap-and-hashtable.md">HashMap 和 Hashtable 的区别</a>
<ul class="org-ul">
<li>Hashtable是同步的，加了synchronized锁，而HashMap不是
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/how-to-concatenate-two-arrays-in-java.md">如何便捷地将两个数组合到一起</a>
<div class="org-src-container">

<pre class="src src-java">// method 1
ArrayUtils.addAll(T[], T...)

// method 2
public Foo[] concat(Foo[] a, Foo[] b) {
   int aLen = a.length;
   int bLen = b.length;
   Foo[] c= new Foo[aLen+bLen];
   System.arraycopy(a, 0, c, 0, aLen);
   System.arraycopy(b, 0, c, aLen, bLen);
   return c;
}

// method 3
public &lt;T&gt; T[] concatenate (T[] a, T[] b) {
    int aLen = a.length;
    int bLen = b.length;

    @SuppressWarnings("unchecked")
    T[] c = (T[]) Array.newInstance(a.getClass().getComponentType(), aLen+bLen);
    System.arraycopy(a, 0, c, 0, aLen);
    System.arraycopy(b, 0, c, aLen, bLen);

    return c;
}
// !!!! 注意，泛型的方案不适用于基本数据类型（int，boolean……)
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/does-java-support-default-parameter-values.md">Java 是否支持默认的参数值</a>
<ul class="org-ul">
<li>builders: 使用创建者模式，你可以设定部分参数是有默认值，部分参数是可选的。如：
</li>
<li>方法（构造函数）重载
</li>
<li>null 的传递
</li>
<li>多参数方式
<div class="org-src-container">

<pre class="src src-java">void foo(String a, Integer... b) {
    Integer b1 = b.length &gt; 0 ? b[0] : 0;
    Integer b2 = b.length &gt; 1 ? b[1] : 0;
    //...
}

foo("a");
foo("a", 1, 2);
</pre>
</div>
<p>
如果不是同一类型, 就用 Object + cast .
</p>
</li>
<li>使用 Map 作为方法中的参数
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/generating-random-integers-in-a-range-with-Java.md">Java 产生指定范围的随机数</a>
<ul class="org-ul">
<li>Math.random(): [0, 1)
</li>
<li>java.util.Random
</li>
<li>org.apache.commons.lang3.RandomUtils
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/what-is-a-javabean-exactly.md">JavaBean 到底是什么</a>
  JavaBean 只是一个标准
<ul class="org-ul">
<li>所有的属性是私有的（通过 getters/setters 处理属性）
</li>
<li>一个公有的无参数的构造器
</li>
<li>实现了序列化（Serializable）
</li>
</ul>
<p>
另外，一个 JavaBean 类和一个普通的类没有语法区别，如果遵循上面的标准
的话，一个类可以认为成 JavaBean 类。
</p>

<p>
之所以需要 JavaBean，是因为这样预定义了一种类的格式，一些库能依据这
个约定的格式，来做一些自动化处理。举个例子，如果一个类库需要通过流来
处理你传递的任何对象，它知道它可以正常处理，因为这个对象是可序列化的。
（假设这个类库要求你的对象是 JavaBeans）
</p>
</li>
<li><code>[&#xa0;]</code> <a href="contents/difference-between-wait-and-sleep.md">wait() 和 sleep() 的区别</a>
</li>
<li><code>[X]</code> <a href="contents/how-do-i-call-one-constructor-from-another-in-java.md">能否在一个构造器中调用另一个构造器</a>
<div class="org-src-container">

<pre class="src src-java">public class Foo {
    private int x;

    public Foo() {
        this(1);
    }

    public Foo(int x) {
        this.x = x;
    }
}
</pre>
</div>

<p>
请注意，在构造器中，你只能调用一次其他的构造器。并且调用其他构造器的
语句，必须是这个构造器的第一个语句。
</p>
</li>
<li><code>[X]</code> <a href="contents/does-finally-always-execute-in-java.md"><code>finally</code> 代码块总会被执行么</a>
<div class="org-src-container">

<pre class="src src-java">try {
    something();
    return success;
} catch (Exception e) {
    return failure;
} finally {
    System.out.println("i don't know if this will get printed out.");
}
// 只有以下情况 finally 不会被调用：
//     +    当你使用 System.exit() 后
//     +    其他线程干扰了现在运行的线程（通过 interrupt 方法）
//     +    JVM 崩溃 (crash) 了
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/convert-a-string-to-an-enum-in-java.md">如何将 String 转换为 enum</a>
<ul class="org-ul">
<li>Blah.valueOf("A") 将会得到 Blah.A
</li>
<li>静态方法 valueOf() 和 values() 不存在于源码中，而是在编译时创建
</li>
<li>hack
<div class="org-src-container">

<pre class="src src-java">public static &lt;T extends Enum&lt;T&gt;&gt; T getEnumFromString(Class&lt;T&gt; c, String string) {
    if( c != null &amp;&amp; string != null ) {
        try {
            return Enum.valueOf(c, string.trim().toUpperCase());
        } catch(IllegalArgumentException ex) {}
    }
    return null;
}

public enum MyEnum {
    ...
    public static MyEnum fromString(String name) {
        return getEnumFromString(MyEnum.class, name);
    }
    ...
}
</pre>
</div>
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/declare-array-in-java.md">在 Java 中声明数组</a>
<div class="org-src-container">

<pre class="src src-java">// primtive type
int[] myIntArray = new int[3];
int[] myIntArray = {1, 2, 3};
int[] myIntArray = new int[]{1, 2, 3};

// string
String[] myStringArray = new String[3];
String[] myStringArray = {"a", "b","c"};
String[] myStringArray = new String[]{"a", "b", "c"};
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/what-is-reflection-and-why-is-it-useful.md">反射是什么及其用途</a>
<div class="org-src-container">

<pre class="src src-java">Method method = foo.getClass().getMethod("dosomething",null);
method.invoke(foo,null);  //调用foo的dosomething方法
</pre>
</div>

<p>
可以看看我的这个笔记 <a href="https://github.com/4ker/JavaAOP">https://github.com/4ker/JavaAOP</a>
</p>
</li>
<li><code>[X]</code> <a href="contents/why-cant-i-switch-on-a-string.md">为什么不能用 string 类型进行 switch 判断</a>
  在 JDK7 中，这个特性已经实现了。在编译阶段，以 string 作为 case 值的代码，会按照特定的模式，被转换为更加复杂的代码。最终的执行代码将是一些使用了 JVM 指令的代码。

<p>
这是在说, java 7 之前是不可以的.
</p>
</li>
<li><code>[X]</code> <a href="contents/comparing-java-enum-members-or-equals.md">比较 java 枚举成员使用 equal 还是 ==</a>
<ul class="org-ul">
<li>如果你看过枚举的源码，你会发现在源码中，equals 也仅仅非常简单的 ==
</li>
<li>其实很简单, 因为 Enum 的 valueOf 方法是从自己的备选项里面枚举, 找到那个 enum 取出来的, 所以内存位置也是一样的.
</li>
<li>还有一个区别是 null.equals 可能有风险, == 则没有
</li>
<li>总而言之，在枚举比较上使用 == ， 因为：
<ul class="org-ul">
<li>能正常工作
</li>
<li>更快
</li>
<li>运行时是安全的
</li>
<li>编译期也是安全的
</li>
</ul>
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/how-to-create-a-file-and-write-to-a-file-in-java.md">用 java 怎么创建一个文件并向该文件写文本内容</a>
<div class="org-src-container">

<pre class="src src-java">// TEXT FILE
// method 1: print writer, text file
PrintWriter writer = new PrintWriter("the-file-name.txt", "UTF-8");
writer.println("The first line");
writer.println("The second line");
writer.close();
// method 2: array of lines to file
List&lt;String&gt; lines = Arrays.asList("The first line", "The second line");
Path file = Paths.get("the-file-name.txt");
Files.write(file, lines, Charset.forName("UTF-8"));
//Files.write(file, lines, Charset.forName("UTF-8"), StandardOpenOption.APPEND);

// BINARY
// method 3: FileOutputStream, binary
byte data[] = ...
FileOutputStream out = new FileOutputStream("the-file-name");
out.write(data);
out.close();
// method 4: FileOutputStream, binary
Path file = Paths.get("the-file-name");
Files.write(file, data);
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/what-is-a-serialversionuid-and-why-should-i-use-it.md">serialVersionUID 有什么作用？该如何使用？</a>
<ul class="org-ul">
<li>对象的序列化主要有两种用途:
<ul class="org-ul">
<li>把对象序列化成字节码，保存到指定介质上 (如磁盘等)
</li>
<li>用于网络传输
</li>
</ul>
</li>
<li>可当我们增加 email 字段后，不作向后兼容。即放弃原来序列化到磁盘的 Person 类，这时我们可以将版本标识提高
</li>
<li>serialVersionUID 就是控制版本是否兼容的，若我们认为修改的 Person 是向后兼容的，
则不修改 serialVersionUID；反之，则提高 serialVersionUID 的值。再回到一开始的问题
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/why-is-java-vector-class-considered-obsolete-or-deprecated.md">为什么 Java 的 <code>Vector</code> 类被认为是过时的或者废弃的</a>
<ul class="org-ul">
<li>Vector 中对每一个独立操作都实现了同步，这通常不是我们想要的做法。
</li>
<li>总的来说，在大多数情况下，这种同步方法是存在很大缺陷的。正如 Mr Brain Henk 指出，
你可以通过调用Collections.synchronizedList来装饰一个集合 - 事实上 Vector 将 “可变数组” 的集合实现
与 “同步每一个方法” 结合起来的做法是另一个糟糕的设计；
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/how-does-the-java-for-each-loop-work.md">Java 的 foreach 循环是如何工作的</a>
  用了 iterator
<div class="org-src-container">

<pre class="src src-java">// for (String item : someList) {System.out.println(item);}
for(Iterator&lt;String&gt; i = someList.iterator(); i.hasNext(); ) {
    String item = i.next();
    System.out.println(item);
}
</pre>
</div>
</li>
<li><code>[X]</code> <a href="file:///why-is-subtracting-these-two-times-in-1927-giving-a-strange-result.md">为什么相减这两个时间（1927 年）会得到奇怪的结果</a>
这是因为 1927 年 11 月 31 日上海的时区改变了。 观看此页获得更多关于
上海 1927 年的细节。 这个问题主要是由于在 1927 年 12 月 31 日的午夜，
时钟回调了 5 分钟零 52 秒。 所以 "1927-12-31 23:54:08" 这个时间实际
上发生了两次，看上去 java 将这个时间解析为之后的那个瞬间。 因此出现
了这种差别。

<p>
这只是美好但奇怪的世界时区中的一个插曲。
</p>

<p>
Shanghai Municipality (<i>mjʊ'nɪsə'pæləti</i>) 自治市
</p>

<p>
Daylight Saving Time (DST) Not Observed in Year 1927
Shanghai observed China Standard Time (CST) all year.
</p>

<p>
DST was not in use in 1927.
</p>
</li>
<li><code>[&#xa0;]</code> <a href="contents/when-and-how-should-i-use-a-threadlocal-variable.md">该什么时候使用 ThreadLocal 变量，它是如何工作的</a>
  一种可能的（也是常见的）使用情形是你不想通过同步方式（synchronized）访问非线程安全的对象（说的就是 SimpleDateFormat）, 而是想给每个线程一个对象实例的时候。 例如
<div class="org-src-container">

<pre class="src src-java">public class Foo
{
    // SimpleDateFormat is not thread-safe, so give one to each thread
    private static final ThreadLocal&lt;SimpleDateFormat&gt; formatter = new ThreadLocal&lt;SimpleDateFormat&gt;(){
        @Override
        protected SimpleDateFormat initialValue() {
            return new SimpleDateFormat("yyyyMMdd HHmm");
        }
    };

    public String formatIt(Date date) {
        return formatter.get().format(date);
    }
}
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> <a href="contents/how-do-servlets-work-instantiation-shared-variables-and-multithreading.md">servlets 的运行原理</a>
</li>
<li><code>[X]</code> <a href="contents/how-can-i-generate-an-md5-hash.md">如何计算 MD5 值</a>
使用 MessageDigest 和 String 时，一定要显式声明你的数据编码类型。如
果你使用无参的 String.getBytes() , 它会以当前平台的默认编码来转换数
据。不同平台的默认编码可能是不同的，这可能会导致你的数据不一致。
<div class="org-src-container">

<pre class="src src-java">import java.security.*;

...
byte[] bytesOfMessage = yourString.getBytes("UTF-8");
MessageDigest md = MessageDigest.getInstance("MD5");
byte[] thedigest = md.digest(bytesOfMessage);
</pre>
</div>
<p>
如果你的要计算的数据量很大，你可以循环使用 .update(byte[]) 方法来加载数据。加载完毕后用 .digest() 方法来得到计算出的 MD5 值。
</p>
</li>
<li><code>[&#xa0;]</code> <a href="contents/what-is-the-difference-between-a-soft-reference-and-a-weak-reference-in-java.md">Java 中软引用和弱引用的区别</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/what-is-the-difference-between-jsf-servlet-and-jsp.md">JSF, Servlet 和 JSP</a>
</li>
<li><code>[X]</code> <a href="contents/java-inner-class-and-static-nested-class.md">Java 内部类和嵌套静态类</a>
  因此, 要实例化一个内部类对象, 必须先实例化外部类对象. 然后用这种语法来创建内部类对象:

<div class="org-src-container">

<pre class="src src-java">OuterClass.InnerClass innerObject = outerObject.new InnerClass();
</pre>
</div>

<p>
这是什么鬼&#x2026;
</p>

<div class="org-src-container">

<pre class="src src-java">class A {
    int t() { return 1; }
    static A a =  new A() { int t() { return 2; } };
}
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/whats-the-difference-between-component-repository-service-annotations-in.md"><code>@Component</code>, <code>@Repository</code>, <code>@Service</code> 的区别</a>
  在 spring 集成的框架中，注解在类上的@Component，@Repository，@Service等注解能否被互换？或者说这些注解有什么区别？

<p>
在 Spring2.0 之前的版本中，@Repository注解可以标记在任何的类上，用来
表明该类是用来执行与数据库相关的操作（即 dao 对象），并支持自动处理
数据库操作产生的异常
</p>

<p>
在 Spring2.5 版本中，引入了更多的 Spring 类注解：
@Component,@Service,@Controller。Component是一个通用的 Spring 容器管
理的单例 bean 组件。而@Repository, @Service, @Controller就是针对不同
的使用场景所采取的特定功能化的注解组件。
</p>

<p>
因此，当你的一个类被@Component所注解，那么就意味着同样可以用
@Repository, @Service, @Controller来替代它，同时这些注解会具备有更多
的功能，而且功能各异。
</p>

<p>
最后，如果你不知道要在项目的业务层采用@Service还是@Component注解。那
么，@Service是一个更好的选择。
</p>

<p>
&#x2014;
</p>

<p>
这几个注解几乎可以说是一样的：因为被这些注解修饰的类就会被 Spring 扫
描到并注入到 Spring 的 bean 容器中。
</p>

<p>
这里，有两个注解是不能被其他注解所互换的：
</p>
<ul class="org-ul">
<li>@Controller 注解的 bean 会被 spring-mvc 框架所使用。
</li>
<li>@Repository 会被作为持久层操作（数据库）的 bean 来使用
</li>
</ul>
</li>
<li><code>[X]</code> <a href="contents/how-to-create-a-generic-array-in-java.md">如何创建泛型 java 数组</a>
<div class="org-src-container">

<pre class="src src-java">public class GenSet&lt;E&gt; {
    private E[] a;

    public GenSet(Class&lt;E&gt; c, int s) {
        // 使用原生的反射方法，在运行时知道其数组对象类型
        @SuppressWarnings("unchecked")
        final E[] a = (E[]) Array.newInstance(c, s);
        this.a = a;
    }

    E get(int i) {
        return a[i];
    }

    //...如果传入参数不为E类型，那么强制添加进数组将会抛出异常
    void add(E e) {...}
}
</pre>
</div>
</li>
</ul>
</div>
</div>
