index.org
*** [8/21] 编程技巧
- [X] [[file:contents/avoiding-null-statements-in-java.md][去掉烦人的 =!=null=（判空语句）]]

  用 Java 8 的 Optional 啊! 懒得看了.
- [X] [[file:contents/get-current-stack-trace-in-java.md][获取完整的堆栈信息]]

  捕获了异常后，如何获取完整的堆栈轨迹（stack trace）
  #+BEGIN_SRC java
  // method 1
  String fullStackTrace = org.apache.commons.lang.exception.ExceptionUtils.getFullStackTrace(e);

  // method 2
  Thread.currentThread().getStackTrace();
  #+END_SRC
- [X] [[file:contents/initialization-of-an-arraylist-in-one-line.md][如何用一行代码初始化一个 ArrayList]]
  #+BEGIN_SRC java
    // good
    ArrayList<String> places = new ArrayList<String>(
        Arrays.asList("Buenos Aires", "Córdoba", "La Plata"));

    // works too. 匿名内部类
    ArrayList<String> list = new ArrayList<String>() {{
        add("A");
        add("B");
        add("C");
    }};
  #+END_SRC
- [X] [[file:contents/how-can-i-initialize-a-static-map.md][初始化静态 map]]

  #+BEGIN_SRC java -r
    // 我使用static初始化器来创建一个固定长度的静态map
    public class Test{
        private static final Map<Integer, String> myMap;
        static {
            Map<Integer, String> aMap = ...;
            aMap.put(1,"one");
            aMap.put(2,"two");
            myMap = Collections.unmodifiableMap(aMap); (ref:h1507011118)
        }
    }

    // 我喜欢用Guava（是 Collection 框架的增强）的方法初始化一个静态的，不可改变的map
    static fianl Map<Integer, String> myMap = ImmutablMap.of(
        1，"one",
        2, "two"
    )

    // build
    static fianl Map<Integer, String> myMap =
            new ImmutableMap.Builder<String, Integer>()
                    .put("one", 1)
                    .put("two", 2)
                    .put("three", 3)
                    .build();
  #+END_SRC
- [X] [[file:contents/check-if-at-least-two-out-of-three-booleans-are-true.md][给 3 个布尔变量，当其中有 2 个或者 2 个以上为 true 才返回 true]]

  这个智障答案...

  我觉得 ~return ((a && b) || (b && c) || (a && c))~ 是最好的.
- [X] [[file:contents/whats-the-simplest-way-to-print-a-java-array.md][输出 Java 数组最简单的方式]]
  #+BEGIN_SRC java
    int[] intArray = new int[] {1, 2, 3, 4, 5};
    System.out.println(Arrays.toString(intArray));
    //输出: [1, 2, 3, 4, 5]

    String[] strArray = new String[] {"John", "Mary", "Bob"};
    System.out.println(Arrays.deepToString(strArray));
    //输出: [John, Mary, Bob]

    // Arrays.deepToString与Arrays.toString不同之处在于，Arrays.deepToString更适合打印多维数组
  #+END_SRC
- [X] [[file:contents/why-is-char-preferred-over-string-for-passwords-in-java.md][什么在 java 中存放密码更倾向于 =char= 而不是 String]]

  String是不可变的。虽然String加载密码之后可以把这个变量扔掉，但是字符
  串并不会马上被GC回收，一但进程在GC执行到这个字符串之前被dump，dump出
  的的转储中就会含有这个明文的字符串。那如果我去“修改”这个字符串，比如
  把它赋一个新值，那么是不是就没有这个问题了？答案是否定的，因为String
  本身是不可修改的，任何基于String的修改函数都是返回一个新的字符串，原
  有的还会在内存里。

  然而对于数组，你可以在抛弃它之前直接修改掉它里面的内容或者置为乱码，
  密码就不会存在了。但是如果你什么也不做直接交给gc的话，也会存在上面一
  样的问题。

  所以，这是一个安全性的问题--但是，即使使用char[]也仅仅是降低了攻击者
  攻击的机会，而且仅仅对这种特定的攻击有效。
- [ ] [[file:contents/how-to-avoid-java-code-in-jsp-files.md][如何避免在 JSP 文件中使用 Java 代码]]
- [ ] [[file:contents/examples-of-gof-design-patterns-in-javas-core-libraries.md][Java 源码里的设计模式]]
- [ ] [[file:contents/how-to-generate-a-random-alpha-numeric-string.md][如何产生一个随机的字母数字串作为 session 的唯一标识符]]

  如果允许产生的随机字符串是可猜测的(随机字符串比较都短,或者使用有缺陷
  的随机数生成器),进而导致攻击者可能会劫持到会话的,可以使用一个相对简
  单随机数生成代码,如下所示:
- [ ] [[file:contents/what-is-an-efficient-way-to-implement-a-singleton-in-java.md][如何创建单例]]
  #+BEGIN_SRC java
    // 预加载
    public class Foo {

        private static final Foo INSTANCE = new Foo();

        private Foo() {
            if (INSTANCE != null) {
                throw new IllegalStateException("Already instantiated");
            }
        }

        public static Foo getInstance() {
            return INSTANCE;
        }
    }

    // 懒加载
    class Foo {

        private static Foo INSTANCE = null;

        private Foo() {
            if (INSTANCE != null) {
                throw new IllegalStateException("Already instantiated");
            }
        }

        public static Foo getInstance() {
            if (INSTANCE == null) {
                INSTANCE = new Foo();
            }
            return INSTANCE;
        }
    }
  #+END_SRC
- [X] [[file:contents/implements-runnable-vs-extends-thread.md][实现 Runnable 接口 VS. 继承 Thread 类]]

  在Java中，并发执行任务一般有两种方式：
  + 实现Runnable接口
  + 继承Thread类

  一般而言，推荐使用方式（1）,主要是由于大多数情况下，人们并不会特别去
  关注线程的行为，也不会去改写Thread已有的行为或方法，仅仅是期望执行任
  务而已。 因此，使用接口的方式能避免引入一些并不需要的东西，同时也不
  会影响继承其他类，并使程序更加灵活。

  额外的tips：
  + Runnable与Thread不是对等的概念

    在Thinking in Java中，作者吐槽过Runnable的命名，称其叫做Task更为合理。
    在Java中，Runnable只是一段用于描述任务的代码段而已，是静态的概念，需要通过线程来执行。而Thread更像是一个活体，自身就具有很多行为，能够用来执行任务。
  + 仅仅当你确实想要重写（override）一些已有行为时，才使用继承，否则请使用接口。
  + 在Java 5之前，创建了Thread却没调用其start()方法，可能导致内存泄露。
- [ ] [[file:contents/which-notnull-java-annotation-should-i-use.md][我应该用哪一个 =@NotNull= 注解]]
- [ ] [[file:contents/how-can-i-convert-a-stack-trace-to-a-string.md][怎样将堆栈追踪信息转换为字符串]]
- [ ] [[file:contents/dealing-with-java-lang-outofmemoryerror-permgen-space-error.md][如何处理 java.lang.outOfMemoryError PermGen space error]]
- [ ] [[file:contents/how-can-i-pad-an-integers-with-zeros-on-the-left.md][如何在整数左填充 0]]
- [ ] [[file:contents/is-null-check-needed-before-calling-instanceof.md][在调用 instanceof 前需要进行 null 检查吗]]
- [ ] [[file:contents/how-do-i-create-a-java-string-from-the-contents-of-a-file.md][如何从文件里读取字符串]]
- [ ] [[file:contents/iterating-through-a-collection-avoiding-concurrentmodificationexception-when-reiterating-through-a-collection-avoiding-concurrentmodificationexception-when-re.md][遍历集合时移除元素，怎样避免 ConcurrentModificationException 异常抛出]]
- [ ] [[file:contents/how-can-i-permanently-have-line-numbers-in-intellij.md][如何让 IntelliJ 编辑器永久性显示代码行数]]
- [ ] [[file:contents/how-can-i-create-an-executable-jar-with-dependencies-using-maven.md][如何使用 maven 把项目及其依赖打包为可运行 jar 包]]
*** 网络
-  [[file:contents/using-java-net-urlconnection-to-fire-and-handle-http-requests.md][如何使用 java.net.URLConnection 接收及发送 HTTP 请求]]
*** 性能
-  [[file:contents/when-to-use-linkedlist-over-arraylist.md][LinkedList、ArrayList 各自的使用场景，如何确认应该用哪一个呢？]]
-  [[file:contents/stringbuilder-and-stringbuffer.md][StringBuilder 和 StringBuffer 有哪些区别呢]]
-  [[file:contents/why-is-processing-a-sorted-array-faster-than-an-unsorted-array.md][为什么处理排序的数组要比非排序的快]]
-  [[file:contents/creating-a-memory-leak-with-java.md][如何使用 Java 创建一个内存泄漏的程序]]
-  [[file:contents/why-is-printing-b-dramatically-slower-than-printing.md][为什么打印“B”会明显的比打印“#”慢]]
*** 测试
-  [[file:contents/how-to-test-a-class-that-has-private-methods-fields-or-inner-classes.md][如何测试 private 方法，变量或者内部类]]
-  [[file:contents/how-do-you-assert-that-a-certain-exception-is-thrown-in-junit-4-tests.md][JUnit4 如何断言确定异常的抛出]]
