index.html
<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> <code>[8/21]</code> 编程技巧</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li><code>[X]</code> <a href="contents/avoiding-null-statements-in-java.md">去掉烦人的 =!=null=（判空语句）</a>

<p>
用 Java 8 的 Optional 啊! 懒得看了.
</p>
</li>
<li><code>[X]</code> <a href="contents/get-current-stack-trace-in-java.md">获取完整的堆栈信息</a>

<p>
捕获了异常后，如何获取完整的堆栈轨迹（stack trace）
</p>
<div class="org-src-container">

<pre class="src src-java">// method 1
String fullStackTrace = org.apache.commons.lang.exception.ExceptionUtils.getFullStackTrace(e);

// method 2
Thread.currentThread().getStackTrace();
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/initialization-of-an-arraylist-in-one-line.md">如何用一行代码初始化一个 ArrayList</a>
<div class="org-src-container">

<pre class="src src-java">// good
ArrayList&lt;String&gt; places = new ArrayList&lt;String&gt;(
    Arrays.asList("Buenos Aires", "Córdoba", "La Plata"));

// works too. 匿名内部类
ArrayList&lt;String&gt; list = new ArrayList&lt;String&gt;() {{
    add("A");
    add("B");
    add("C");
}};
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/how-can-i-initialize-a-static-map.md">初始化静态 map</a>

<div class="org-src-container">

<pre class="src src-java">// 我使用static初始化器来创建一个固定长度的静态map
public class Test{
    private static final Map&lt;Integer, String&gt; myMap;
    static {
        Map&lt;Integer, String&gt; aMap = ...;
        aMap.put(1,"one");
        aMap.put(2,"two");
<span id="coderef-h1507011118" class="coderef-off">        myMap = Collections.unmodifiableMap(aMap);</span>
    }
}

// 我喜欢用Guava（是 Collection 框架的增强）的方法初始化一个静态的，不可改变的map
static fianl Map&lt;Integer, String&gt; myMap = ImmutablMap.of(
    1，"one",
    2, "two"
)

// build
static fianl Map&lt;Integer, String&gt; myMap =
        new ImmutableMap.Builder&lt;String, Integer&gt;()
                .put("one", 1)
                .put("two", 2)
                .put("three", 3)
                .build();
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/check-if-at-least-two-out-of-three-booleans-are-true.md">给 3 个布尔变量，当其中有 2 个或者 2 个以上为 true 才返回 true</a>

<p>
这个智障答案&#x2026;
</p>

<p>
我觉得 <code>return ((a &amp;&amp; b) || (b &amp;&amp; c) || (a &amp;&amp; c))</code> 是最好的.
</p>
</li>
<li><code>[X]</code> <a href="contents/whats-the-simplest-way-to-print-a-java-array.md">输出 Java 数组最简单的方式</a>
<div class="org-src-container">

<pre class="src src-java">int[] intArray = new int[] {1, 2, 3, 4, 5};
System.out.println(Arrays.toString(intArray));
//输出: [1, 2, 3, 4, 5]

String[] strArray = new String[] {"John", "Mary", "Bob"};
System.out.println(Arrays.deepToString(strArray));
//输出: [John, Mary, Bob]

// Arrays.deepToString与Arrays.toString不同之处在于，Arrays.deepToString更适合打印多维数组
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/why-is-char-preferred-over-string-for-passwords-in-java.md">什么在 java 中存放密码更倾向于 <code>char</code> 而不是 String</a>

<p>
String是不可变的。虽然String加载密码之后可以把这个变量扔掉，但是字符
串并不会马上被GC回收，一但进程在GC执行到这个字符串之前被dump，dump出
的的转储中就会含有这个明文的字符串。那如果我去“修改”这个字符串，比如
把它赋一个新值，那么是不是就没有这个问题了？答案是否定的，因为String
本身是不可修改的，任何基于String的修改函数都是返回一个新的字符串，原
有的还会在内存里。
</p>

<p>
然而对于数组，你可以在抛弃它之前直接修改掉它里面的内容或者置为乱码，
密码就不会存在了。但是如果你什么也不做直接交给gc的话，也会存在上面一
样的问题。
</p>

<p>
所以，这是一个安全性的问题&#x2013;但是，即使使用char[]也仅仅是降低了攻击者
攻击的机会，而且仅仅对这种特定的攻击有效。
</p>
</li>
<li><code>[&#xa0;]</code> <a href="contents/how-to-avoid-java-code-in-jsp-files.md">如何避免在 JSP 文件中使用 Java 代码</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/examples-of-gof-design-patterns-in-javas-core-libraries.md">Java 源码里的设计模式</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/how-to-generate-a-random-alpha-numeric-string.md">如何产生一个随机的字母数字串作为 session 的唯一标识符</a>

<p>
如果允许产生的随机字符串是可猜测的(随机字符串比较都短,或者使用有缺陷
的随机数生成器),进而导致攻击者可能会劫持到会话的,可以使用一个相对简
单随机数生成代码,如下所示:
</p>
</li>
<li><code>[&#xa0;]</code> <a href="contents/what-is-an-efficient-way-to-implement-a-singleton-in-java.md">如何创建单例</a>
<div class="org-src-container">

<pre class="src src-java">// 预加载
public class Foo {

    private static final Foo INSTANCE = new Foo();

    private Foo() {
        if (INSTANCE != null) {
            throw new IllegalStateException("Already instantiated");
        }
    }

    public static Foo getInstance() {
        return INSTANCE;
    }
}

// 懒加载
class Foo {

    private static Foo INSTANCE = null;

    private Foo() {
        if (INSTANCE != null) {
            throw new IllegalStateException("Already instantiated");
        }
    }

    public static Foo getInstance() {
        if (INSTANCE == null) {
            INSTANCE = new Foo();
        }
        return INSTANCE;
    }
}
</pre>
</div>
</li>
<li><code>[X]</code> <a href="contents/implements-runnable-vs-extends-thread.md">实现 Runnable 接口 VS. 继承 Thread 类</a>

<p>
在Java中，并发执行任务一般有两种方式：
</p>
<ul class="org-ul">
<li>实现Runnable接口
</li>
<li>继承Thread类
</li>
</ul>
<p>
一般而言，推荐使用方式（1）,主要是由于大多数情况下，人们并不会特别去
关注线程的行为，也不会去改写Thread已有的行为或方法，仅仅是期望执行任
务而已。 因此，使用接口的方式能避免引入一些并不需要的东西，同时也不
会影响继承其他类，并使程序更加灵活。
</p>

<p>
额外的tips：
</p>
<ul class="org-ul">
<li>Runnable与Thread不是对等的概念

<p>
在Thinking in Java中，作者吐槽过Runnable的命名，称其叫做Task更为合理。
在Java中，Runnable只是一段用于描述任务的代码段而已，是静态的概念，需要通过线程来执行。而Thread更像是一个活体，自身就具有很多行为，能够用来执行任务。
</p>
</li>
<li>仅仅当你确实想要重写（override）一些已有行为时，才使用继承，否则请使用接口。
</li>
<li>在Java 5之前，创建了Thread却没调用其start()方法，可能导致内存泄露。
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> <a href="contents/which-notnull-java-annotation-should-i-use.md">我应该用哪一个 <code>@NotNull</code> 注解</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/how-can-i-convert-a-stack-trace-to-a-string.md">怎样将堆栈追踪信息转换为字符串</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/dealing-with-java-lang-outofmemoryerror-permgen-space-error.md">如何处理 java.lang.outOfMemoryError PermGen space error</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/how-can-i-pad-an-integers-with-zeros-on-the-left.md">如何在整数左填充 0</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/is-null-check-needed-before-calling-instanceof.md">在调用 instanceof 前需要进行 null 检查吗</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/how-do-i-create-a-java-string-from-the-contents-of-a-file.md">如何从文件里读取字符串</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/iterating-through-a-collection-avoiding-concurrentmodificationexception-when-reiterating-through-a-collection-avoiding-concurrentmodificationexception-when-re.md">遍历集合时移除元素，怎样避免 ConcurrentModificationException 异常抛出</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/how-can-i-permanently-have-line-numbers-in-intellij.md">如何让 IntelliJ 编辑器永久性显示代码行数</a>
</li>
<li><code>[&#xa0;]</code> <a href="contents/how-can-i-create-an-executable-jar-with-dependencies-using-maven.md">如何使用 maven 把项目及其依赖打包为可运行 jar 包</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> 网络</h4>
<div class="outline-text-4" id="text-1-4-3">
<ul class="org-ul">
<li><a href="contents/using-java-net-urlconnection-to-fire-and-handle-http-requests.md">如何使用 java.net.URLConnection 接收及发送 HTTP 请求</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> 性能</h4>
<div class="outline-text-4" id="text-1-4-4">
<ul class="org-ul">
<li><a href="contents/when-to-use-linkedlist-over-arraylist.md">LinkedList、ArrayList 各自的使用场景，如何确认应该用哪一个呢？</a>
</li>
<li><a href="contents/stringbuilder-and-stringbuffer.md">StringBuilder 和 StringBuffer 有哪些区别呢</a>
</li>
<li><a href="contents/why-is-processing-a-sorted-array-faster-than-an-unsorted-array.md">为什么处理排序的数组要比非排序的快</a>
</li>
<li><a href="contents/creating-a-memory-leak-with-java.md">如何使用 Java 创建一个内存泄漏的程序</a>
</li>
<li><a href="contents/why-is-printing-b-dramatically-slower-than-printing.md">为什么打印“B”会明显的比打印“#”慢</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> 测试</h4>
<div class="outline-text-4" id="text-1-4-5">
<ul class="org-ul">
<li><a href="contents/how-to-test-a-class-that-has-private-methods-fields-or-inner-classes.md">如何测试 private 方法，变量或者内部类</a>
</li>
<li><a href="contents/how-do-you-assert-that-a-certain-exception-is-thrown-in-junit-4-tests.md">JUnit4 如何断言确定异常的抛出</a>
</li>
</ul>
</div>
</div>
